slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Site Demo</title>
<meta name="author" content="Adam Washington"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Site Demo</h1><p class="subtitle"></p>
<h2 class="author">Adam Washington</h2><h2 class="date">2024-05-22</h2><p class="date">Created: 2024-05-21 Tue 18:33</p>
</section>
<section id="sec-table-of-contents"><div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#/slide-orgbae9cca">1. Basics</a></li>
<li><a href="#/slide-org71a60ba">2. Layout</a></li>
<li><a href="#/slide-org82cf50d">3. Maintenance</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgbae9cca">
<h2 id="orgbae9cca"><span class="section-number-2">1.</span> Basics</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-org3bfc8d7">
<h3 id="org3bfc8d7"><span class="section-number-3">1.1.</span> Prototype</h3>
<ul>
<li>Possible changes to the Scientific Software Pages</li>
<li>Just a prototype
<ul>
<li>Just discussing desired content</li>
<li>Intentionally unprofessional font and minimal styling</li>

</ul></li>
<li>Only high level content discussion
<ul>
<li>What to say, not how to say it</li>

</ul></li>

</ul>

</section>
<section id="slide-org47c1f10">
<h3 id="org47c1f10"><span class="section-number-3">1.2.</span> Open Questions</h3>
<ul>
<li>What other info should be included on the project pages?</li>

<li>Is there a better way to organise the projects than by technique?</li>

<li>Is the recent news useful?</li>

</ul>

</section>
</section>
<section>
<section id="slide-org71a60ba">
<h2 id="org71a60ba"><span class="section-number-2">2.</span> Layout</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
<section id="slide-org552ce33">
<h3 id="org552ce33"><span class="section-number-3">2.1.</span> Site</h3>
<p>
<a href="https://rprospero.github.io/rse-site-demo/compact.html">Link</a>
</p>

</section>
<section id="slide-org4d5f6f6">
<h3 id="org4d5f6f6"><span class="section-number-3">2.2.</span> Open Questions</h3>
<ul>
<li>Is there a better way to handle the grouping?
<ul>
<li>Some instruments have nothing beyond Mantid</li>
<li>Some instruments have multiple techniques</li>

</ul></li>
<li>Would we even need the project pages?</li>
<li>Do we need more/less columns?
<ul>
<li>Do the logos add anything?</li>
<li>Do we need to link to the source?</li>

</ul></li>

</ul>

</section>
</section>
<section>
<section id="slide-org82cf50d">
<h2 id="org82cf50d"><span class="section-number-2">3.</span> Maintenance</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
<section id="slide-orgd98c749">
<h3 id="orgd98c749"><span class="section-number-3">3.1.</span> Maintenance Script</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<ol class="org-ol">
<li><a id="org3d3e259"></a>Goals<br />
<ul>
<li>Allow site maintainer to keep site up to date</li>
<li>Not require extra work from project teams</li>
<li>Only require a few minutes a month (amortised)</li>

</ul>
</li>
</ol>

</section>
<section id="slide-org3c09be0">
<h3 id="org3c09be0"><span class="section-number-3">3.2.</span> Partial Implementation</h3>
<ul>
<li>Every package has a test in the python <code>unittest</code> package</li>
<li>Run the test each month
<ul>
<li>if every test passes, there's nothing to do</li>

</ul></li>
<li>If a test fails, there's probably been an update to a package
<ul>
<li>Update the test to pass again</li>
<li>If there's been an update to the package, also update the site</li>

</ul></li>
<li>Intentionally brittle</li>

</ul>

</section>
<section id="slide-org3831c24">
<h3 id="org3831c24"><span class="section-number-3">3.3.</span> Example Script</h3>
<div class="org-src-container">

<pre  class="src src-python"   ><code trim><span style="color: #e392ff;">def</span> <span style="color: #00bcff;">test_dissolve</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span><span style="color: #e392ff;">)</span>:
    <span style="color: #ff8754;">version</span> = <span style="color: #00d4b2;">"1.5.1"</span>

    <span style="color: #ff8754;">r</span> = requests.get<span style="color: #e392ff;">(</span><span style="color: #00d4b2;">"https://projectdissolve.com/packages/"</span><span style="color: #e392ff;">)</span>
    <span style="color: #e392ff;">self</span>.assertEqual<span style="color: #e392ff;">(</span>r.status_code, 200<span style="color: #e392ff;">)</span>
    <span style="color: #ff8754;">soup</span> = BeautifulSoup<span style="color: #e392ff;">(</span>r.text, features=<span style="color: #00d4b2;">"html.parser"</span><span style="color: #e392ff;">)</span>
    <span style="color: #ff8754;">actual</span> = soup.select_one<span style="color: #e392ff;">(</span><span style="color: #00d4b2;">'a[href="#release"]'</span><span style="color: #e392ff;">)</span>.get_text<span style="color: #e392ff;">()</span>
    <span style="color: #e392ff;">self</span>.assertEqual<span style="color: #e392ff;">(</span>version, actual<span style="color: #e392ff;">)</span>

</code></pre>
</div>

</section>
<section id="slide-orgdc6daee">
<h3 id="orgdc6daee"><span class="section-number-3">3.4.</span> Official Implementation</h3>
<p>
<a href="https://isisneutronmuon.github.io/">https://isisneutronmuon.github.io/</a>
</p>

<p>
Fully automated via GitHub action
</p>

</section>
<section id="slide-org332a88e">
<h3 id="org332a88e"><span class="section-number-3">3.5.</span> Comparison</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Mine</th>
<th scope="col" class="org-left">Official</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Human needed for updates</td>
<td class="org-left">Human needed when it breaks</td>
</tr>

<tr>
<td class="org-left">Link to official project download page</td>
<td class="org-left">Always use GitHub release page</td>
</tr>

<tr>
<td class="org-left">Checks for dead site links</td>
<td class="org-left">Doesn't bother with site links</td>
</tr>
</tbody>
</table>

<p>
Ultimately, the page needs to be on the ISIS SharePoint site, which
limits the options for full automation.
</p>

</section>
<section id="slide-org2e8e11d">
<h3 id="org2e8e11d"><span class="section-number-3">3.6.</span> Open Question</h3>
<p>
Which approach do we prefer?
</p>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]

});

</script>
</body>
</html>
